---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipingSystemType
source: html/b0fe0b71-3b6c-85f0-8279-e93505e82529.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystemType

Base class for piping system types

## Syntax (C#)
```csharp
public class PipingSystemType : MEPSystemType
```